Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: This means, you can get a working filesystem very fast, and add native support for symlinks and other features later.
pt_pt: Ou seja, você pode conseguir um sistema de arquivos funcionando bem rápido e adicionar suporte nativo aos symlinks e a outras funcionalidades mais tarde.

source: Passive Translators, Active Translators
pt_pt: Tradutores passivos, tradutores ativos

source: There are two types of translators, passive and active.
pt_pt: Existem dois tipos de tradutores, passivos e ativos.

source: They are really completely different things, so don't mix them up, but they have a close relation to each other.
pt_pt: Eles realmente são coisas completamente diferentes, então não confunda; mas eles mantêm uma relação próxima.

source: Active Translators
pt_pt: Tradutores ativos

source: An active translator is a running translator process, as introduced above.
pt_pt: Um tradutor ativo é um processo de tradutor em execução, como visto acima.

source: You can set and remove active translators using the settrans -a command.
pt_pt: Você pode definir e remover tradutores ativos usando o comando settrans -a.

source: The -a option is necessary to tell settrans that you want to modify the active translator.
pt_pt: A opção -a é necessária para dizer ao settrans que você quer modificar o tradutor ativo.

source: The settrans command takes three kind of arguments.
pt_pt: O comando settrans recebe três tipos de argumentos.

source: First, you can set options for the settrans command itself, like -a to modify the active translator.
pt_pt: Primeiro, você pode definir opções para o comando settrans mesmo, como -a para modificar o tradutor ativo.

source: Then you set the inode you want to modify.
pt_pt: A seguir você define o inode que quer modificar.

source: Remember that a translator is always associated with an inode in the directory hierarchy.
pt_pt: Lembre-se que um tradutor está sempre associado com um inode na hierarquia de diretórios.

source: You can only modify one inode at a time.
pt_pt: Você somente pode modificar um inode por vez.

source: If you do not specify any more arguments, settrans will try to remove an existing translator.
pt_pt: Se você não especificar mais nenhum argumento, settrans tentará remover um tradutor existente.

source: How hard it tries depends on the force options you specify (if the translator is in use by any process, you will get "device or resource busy" error message unless you force it to go away).
pt_pt: O quanto ele vai tentar depende das opções de imposição que você especificar (se o tradutor está em uso por qualquer processo, você obterá uma mensagem de erro "device or resource busy" - dispositivo ou recurso ocupado - a menos que você force a remoção).

source: But if you specify further arguments, it will be interpreted as a command line to run the translator.
pt_pt: Mas se você especificar argumentos adicionais, eles serão interpretados como uma linha de comando para executar o tradutor.

source: This means, the next argument is the filename of the translator executable.
pt_pt: Isto é, o próximo argumento é o nome de arquivo do executável do tradutor.

source: Further arguments are options to the translator, and not to the settrans command.
pt_pt: Argumentos adicionais são opções para o tradutor, e não para o comando settrans.

source: For example, to mount an ext2fs partition, you can run settrans -a -c /mnt /hurd/ext2fs /dev/hd2s5.
pt_pt: Por exemplo, para montar uma partição ext2fs, você pode executar settrans -a -c /mnt /hurd/ext2fs /dev/hd2s5.

source: The -c option will create the mount point for you if it doesn't exist already.
pt_pt: A opção -c criará um ponto de montagem se ele ainda não existir.

source: This does not need to be a directory, by the way.
pt_pt: Aliás, não precisa ser um diretório.

source: To unmount, you would try settrans -a /mnt.
pt_pt: Para desmontar, você tentaria settrans -a /mnt.

source: Passive Translators
pt_pt: Tradutores passivos

source: A passive translator is set and modified with the same syntax as the active translator (just leave away the -a), so everything said above is true for passive translators, too.
pt_pt: Um tradutor passivo é definido e modificado pela mesma sintaxe dos tradutores ativos (somente ignore a opção -a), então tudo o que foi dito acima também é verdade para os tradutores passivos.

source: However, there is a difference: passive translators are not yet started.
pt_pt: Contudo, existe uma diferença: tradutores passivos ainda não foram iniciados.

source: This makes sense, because this is what you usually want.
pt_pt: Isto faz sentido porque isto é o que você geralmente quer.

source: You don't want the partition mounted unless you really access files on this partition.
pt_pt: Você não quer a partição montada a menos que você realmente acesse os arquivos nesta partição.

source: You don't want to bring up the network unless there is some traffic and so on.
pt_pt: Você não quer ligar a rede a menos que exista algum tráfego, e assim por diante.

source: Instead, the first time the passive translator is accessed, it is automatically read out of the inode and an active translator is started on top of it using the command line that was stored in the inode.
pt_pt: Ao contrário, a primeira vez que um tradutor passivo é acessado, ele é automaticamente lido do inode e um tradutor ativo é iniciado a partir dele usando a linha de comando que foi armazenada no inode.

source: This is similar to the Linux automounter functionality.
pt_pt: Isto é similar à funcionalidade de montagem automática do Linux.

source: However, it does not come as an additional bonus that you have to set up manually, but an integral part of the system.
pt_pt: Contudo, ele não vem como um bônus que você tem que configurar manualmente, mas como uma parte integral do sistema.

source: So, setting passive translators defers starting the translator task until you really need it.
pt_pt: Assim, definir tradutores passivos posterga o início da tarefa de tradutor até que você realmente precise dela.

source: By the way, if the active translator dies for some reason, the next time the inode is accessed the translator is restarted.
pt_pt: A propósito, se o tradutor ativo morre por alguma razão, a próxima vez em que o inode for acessado, o tradutor é reiniciado.

source: There is a further difference: active translators can die or get lost.
pt_pt: Existe uma outra diferença: tradutores ativos podem morrer ou se perder.

source: As soon as the active translator process is killed (for example, because you reboot the machine) it is lost forever.
pt_pt: Logo após o término do processo do tradutor ativo (por exemplo, porque você reiniciou a máquina), ele estará perdido para sempre.

source: Passive translators are not transient and stay in the inode during reboots until you modify them with the settrans program or delete the inodes they are attached to.
pt_pt: Tradutores passivos não são transientes e ficam no inode durante a reinicialização até que você modifique-os com o programa settrans ou apague os inodes aos quais estão anexados.

source: This means, you don't need to maintain a configuration file with your mount points.
pt_pt: Isto significa que você não precisa manter um arquivo de configuração com seus pontos de montagem.

source: One last point: Even if you have set a passive translator, you can still set a different active translator.
pt_pt: Um último ponto: mesmo se você definiu um tradutor passivo, você ainda pode definir um tradutor ativo diferente.

source: Only if the translator is automatically started because there was no active translator the time the inode was accessed the passive translator is considered.
pt_pt: Somente se o tradutor é automaticamente iniciado porque não existia tradutor ativo quando o inode foi acessado, assim o tradutor passivo é considerado.

source: Managing Translators
pt_pt: Gerenciando tradutores

source: As mentioned above, you can use settrans to set and alter passive and active translators.
pt_pt: Como mencionado acima, você pode usar settrans para definir e alterar tradutores passivos e ativos.

source: There are a lot of options to change the behaviour of settrans in case something goes wrong, and to conditionalize its action.
pt_pt: Existem muitas opções para alterar o comportamento do settrans no caso de algo dar errado e para condicionar suas ações.

source: Here are some common usages:
pt_pt: Aqui estão alguns usos comuns:

source: · settrans -c /mnt /hurd/ext2fs /dev/hd2s5 mounts a partition, the translator will stay across reboots.
pt_pt: · settrans -c /mnt /hurd/ext2fs /dev/hd2s5 monta uma partição, o tradutor permanece após a reinicialização.

source: · settrans -a /mnt /hurd/ext2fs ~/dummy.fs mounts a filesystem inside a data file, the translator will go away if it dies.
pt_pt: · settrans -a /mnt /hurd/ext2fs ~/dummy.fs monta um sistema de arquivos dentro de um arquivo de dados, o tradutor some se ele morrer.

source: · settrans -fg /nfs-data forces a translator to go away.
pt_pt: · settrans -fg /nfs-data força um tradutor a sumir.

source: You can use the showtrans command to see if a translator is attached to an inode.
pt_pt: Você pode usar o comando showtrans para ver se um tradutor está anexado a um inode.

source: This will only show you the passive translator though.
pt_pt: Porém, isso só vai mostrar o tradutor passivo.

source: You can change the options of an active (filesystem) translator with fsysopts without actually restarting it.
pt_pt: Você pode alterar as opções de um tradutor ativo (de sistema de arquivos) com fsysopts sem realmente reiniciá-lo.

source: This is very convenient.
pt_pt: Isto é muito conveniente.

source: For example, you can do what is called "remounting a partition read-only" under Linux simply by running fsysopts /mntpoint --readonly.
pt_pt: Por exemplo, você pode fazer o chamado "remontando uma partição somente-leitura" sob o Linux executando simplesmente fsysopts /mntpoint --readonly.

source: The running active translator will change its behaviour according to your request if possible. fsysopts /mntpoint without a parameter shows you the current settings.
pt_pt: O tradutor ativo em execução mudará seu comportamento de acordo com sua requisição, se possível. O fsysopts /mntpoint sem nenhum parâmetro mostra as configurações atuais.

source: I recommend that you start by reading the /bin/mount command, it is only a small script.
pt_pt: Eu recomendo que você inicie pela leitura do comando /bin/mount, é só um pequeno script.

source: Because setting filesystem translators is similar to mounting partitions, you can easily grasp the concept this way.
pt_pt: Devido à configuração de tradutores de sistemas de arquivos ser similar à montagem de partições, você facilmente pode captar o conceito desta maneira.

source: Make a file system image with dd if=/dev/zero of=dummy.fs bs=1024k count=8; mke2fs dummy.fs and "mount" it with settrans -c dummy /hurd/ext2fs `pwd`/dummy.fs.
pt_pt: Crie uma imagem de sistema de arquivo com dd if=/dev/zero of=dummy.fs bs=1024k count=8; mke2fs dummy.fs e "monte-a" com settrans -c dummy /hurd/ext2fs `pwd`/dummy.fs.

source: Note that the translator is not started yet, no new ext2fs process is running (verify with ps Aux).
pt_pt: Note que o tradutor ainda não iniciou, nenhum novo processo ext2fs está executando (verifique com ps Aux).

source: Check that everything is correct using showtrans.
pt_pt: Verifique se tudo está correto usando showtrans.

source: Now type ls dummy and you will notice the short delay that occurs while the translator is started.
pt_pt: Agora digite ls dummy e você perceberá um curto atraso que acontece enquanto o tradutor é iniciado.

source: After that, there will be no more delays accessing dummy.
pt_pt: Após isso, não haverá mais atrasos acessando o dummy.

source: Under Linux, one would say that you automounted a loop file system.
pt_pt: Sob o Linux, poderia se dizer que você montou automaticamente um sistema de arquivo em loop.

source: Check with ps Aux that there is an ext2fs dummy process up and running now.
pt_pt: Verifique com ps Aux que agora existe um processo ext2fs dummy ativo e executando.

source: Now put some files into the new directory.
pt_pt: Agora coloque alguns arquivos no novo diretório.

source: Try to make the filesystem read-only with fsysopts.
pt_pt: Tente fazer o sistema de arquivos ficar em somente-leitura com fsysopts.

source: Note how further write attempts fail now.
pt_pt: Note quão longe vão as falhas das tentativas de escrita.

source: Try to kill the active translator with settrans -g.
pt_pt: Tente matar o tradutor ativo com settrans -g.

source: You should have some understanding of what is going on now.
pt_pt: Agora você deve ter alguma compreensão do que está acontecendo.

source: Now remember that this was only one special server, the Hurd ext2fs server.
pt_pt: Lembre-se de que foi somente um servidor especial, o servidor ext2fs do Hurd.

source: There are many more server in the hurd directory.
pt_pt: Existem muitos mais servidores no diretório hurd.

source: Some of them are for filesystems.
pt_pt: Alguns deles são para sistemas de arquivos.

source: Some are needed for file system features like links.
pt_pt: Alguns são necessários para funcionalidades de sistemas de arquivo, como os links.

source: Some are needed for device files.
pt_pt: Alguns são necessários para arquivos de dispositivos.

source: Some are useful for networking.
pt_pt: Alguns são úteis para redes.

source: Imagine "mounting" an FTP Server with settrans and downloading files simply with the standard cp command.
pt_pt: Imagine "montar" um servidor FTP com settrans e baixar arquivos simplesmente com o comando padrão cp.

source: Or editing your web sites with emacs /ftp/homepage.my.server.org/index.html!
pt_pt: Ou editar seus sites web com emacs /ftp/homepage.my.server.org/index.html!

source: Deutsch français Italiano Nederlands Português Русский (Russkij)
pt_pt: Deutsch English français Italiano Nederlands Русский (Russkij)

source: Last Modified: Fri, Sep 3 15:18:34 UTC 2004 Last Built: Tue, Aug 6 19:48:34 UTC 2024
pt_pt: Última Modificação: Dom, 27 de Set de 2020, 16:58:30 UTC Última compilação: Ter, 6 de Ago de 2024, 22:07:55 UTC

source: Copyright © 1997-2004 SPI and others; See license terms
pt_pt: Copyright © 1997-2020 SPI e outros; Veja os termos de licença

source: Debian Developers' Corner / Autobuilder network / Outline of operation of the autobuilder network
pt_pt: Canto dos(as) desenvolvedores(as) Debian / Rede autobuilder / Esboço da operação da rede autobuilder

source: Outline of operation of the autobuilder network
pt_pt: Esboço da operação da rede autobuilder

source: At the heart of the system is the wanna-build database, which keeps track of package versions and states. quinn-diff compares the package lists for the target architecture against the list of source packages after every archive update and feeds a list of packages that need re-compilation into the database where they enter state Needs-Build.
pt_pt: No coração do sistema está o banco de dados wanna-build, o qual monitora as versões e estados dos pacotes. O quinn-diff compara as listas de pacotes para dada arquitetura contra a lista de pacotes-fonte após cada atualização de repositório, e alimenta o banco de dados com a lista de pacotes que precisam de recompilação, momento em que eles entram no estado Needs-Build.

source: All the build daemons (there can be more than one) query the database regularly for such packages and take some of them so that they go into state Building.
pt_pt: Todo daemon de construção (pode haver mais de um) consulta o banco de dados regularmente por tais pacotes e pega alguns deles de modo que entrem no estado Building.

source: Of course, humans also can take packages, e.g. in special cases where automatic compilation isn't possible.
pt_pt: Claro, pessoas também podem pegar os pacotes, por exemplo, nos casos especiais em que a compilação automática não é possível.

source: Here we also see the second purpose of wanna-build: It ensures that the same version of a package won't be built twice.
pt_pt: Aqui também vemos o segundo propósito de wanna-build: ele assegura que a mesma versão do pacote não será construída duas vezes.

source: Figure: Package States and Transitions
pt_pt: Figura: Estados do pacote e transições

source: If everything goes well, a finished package can be uploaded later, which is another state Uploaded.
pt_pt: Se tudo correr bem, um pacote finalizado pode ser enviado posteriormente, que é outro estado, Uploaded.

source: After that it will eventually be installed into the Debian archive so it appears in the updated package list for the target architecture.
pt_pt: A seguir, ele eventualmente será instalado no repositório do Debian para assim aparecer na lista de pacotes atualizados para uma determinada arquitetura.

source: This list will be merged into the database, so the package will go to state Installed and remains there until the next version of the source package.
pt_pt: Essa lista será integrada ao banco de dados, de modo que o pacote vá para o estado Installed e permaneça ali até a próxima versão do pacote-fonte.

source: There are several other states; they include: Failed is for packages that failed to build due to errors in the sources, and the errors are expected to be fixed in a successor version (after reporting the problem, of course).
pt_pt: Há muitos outros estados; eles incluem: Failed é para pacotes que falharam na construção devido a erros nos pacotes-fonte, e espera-se que esses erros sejam corrigidos em uma próxima versão (após o problema ser relatado, claro).

source: So a new version will directly enter Needs-Build, but with a warning that something was wrong with the previous version.
pt_pt: Então, uma nova versão entrará diretamente em Needs-Build, mas com um alerta de que alguma coisa estava errada com a versão anterior.

source: Along with this state an error description is stored.
pt_pt: Junto com esse estado, uma descrição de erro é armazenada.

source: State Dep-Wait is used when a package needs some other packages to be compiled but those aren't available yet and must be built before.
pt_pt: O estado Dep-Wait é usado quando um pacote precisa de outros pacotes para ser compilado, mas estes ainda não estão disponíveis e precisam ser construídos anteriormente.

source: This state stores a list of required packages and maybe versions, and if all of them are known to be installed the state changes back to Needs-Build.
pt_pt: Este estado armazena uma lista de pacotes requeridos e talvez as versões; e se todos eles são reconhecidos como instalados, o estado muda de volta para Needs-Build.

source: As we have already seen, the build daemon takes packages from the database for compiling them.
pt_pt: Como já vimos, o daemon de construção pega os pacotes do banco de dados para compilá-los.

source: Let's look a bit closer: If it has some packages to build, it uses sbuild for the actual compilation process, and for each build a log is mailed to the maintainer of the daemon.
pt_pt: Vamos examinar melhor: se ele tem alguns pacotes para construir, ele usa o sbuild para o processo de compilação real, e para cada construção um log é enviado por e-mail ao(à) mantenedor(a) do daemon.

source: He reviews the log and decides what to do with the package: upload it, set it to Failed or Dep-Wait and retry it, etc...
pt_pt: Ele(a) revisa o log e decide o que fazer com o pacote: fazer upload, defini-lo como Failed ou Dep-Wait e tentar novamente, etc.

source: If a positive acknowledgement (a signed .changes file) is received, the daemon moves it to an upload directory, from where all packages are uploaded by a cron job.
pt_pt: Se uma confirmação positiva (um arquivo assinado .changes) é recebida, o daemon move o pacote para um diretório de upload, de onde todos os pacotes são enviados por um cron job.

source: Looking at the log files is the only human intervention in the whole process if no errors happen.
pt_pt: Examinar os arquivos de log é a única intervenção humana em todo o processo se nenhum erro acontece.

source: There are two good reasons for not further automating this: First, sometimes builds end with an ``OK'' result but the build nevertheless failed for reasons that are invisible to the machine.
pt_pt: Existem duas boas razões para não automatizarmos ainda mais: primeiro, algumas vezes as construções terminam com um resultado "OK", mas mesmo assim a construção falhou por motivos que são invisíveis à máquina.

source: And second, directly uploading would require to automatically OpenPGP-sign the resulting files with a key without passphrase on the build machine.
pt_pt: E segundo, o upload direto demandaria assinaturas de OpenPGP automáticas nos arquivos resultantes com uma chave sem senha na máquina de construção.

source: I considered this an unacceptable security hole.
pt_pt: Eu considero isso uma falha de segurança inaceitável.

source: The build script sbuild more or less just calls some standard Debian tools to compile the sources.
pt_pt: O script de construção sbuild meio que somente chama algumas ferramentas padrões do Debian para compilar os fontes.

source: It also helps with some common tasks and bookkeeping and with automatically installing the build-dependencies as requested by the package being built.
pt_pt: Ele também ajuda com algumas tarefas comuns e contabilidades, e com a instalação automática de build-dependencies como requisitadas pelo pacote que está sendo construído.

source: Content developed by Roman Hodek for the 6th International Linux-Kongress 1999; it was gently updated to reflect the current reality a bit more by Philipp Kern in 2009
pt_pt: Artigo desenvolvido por Roman Hodek para o 6th International Linux-Kongress 1999; ele foi levemente atualizado para melhor refletir a realidade atual por Philipp Kern em 2009

source: Deutsch español français Italiano Nederlands 日本語 (Nihongo) polski Português Русский (Russkij)
pt_pt: Deutsch English español français Italiano Nederlands 日本語 (Nihongo) polski Русский (Russkij)

source: Last Modified: Fri, Oct 6 21:55:11 UTC 2023 Last Built: Tue, Aug 6 19:40:17 UTC 2024
pt_pt: Última Modificação: Seg, 8 de Abr de 2024, 18:44:21 UTC Última compilação: Ter, 6 de Ago de 2024, 22:04:38 UTC

source: Debian reports / Community Distribution Patent Policy FAQ
pt_pt: Relatórios Debian / FAQ da política de patente de distribuição da comunidade

source: Community Distribution Patent Policy FAQ
pt_pt: FAQ da política de patente de distribuição da comunidade

source: Version: 1.0
pt_pt: Versão: 1.0

source: Published: 8 July 2011
pt_pt: Publicada: 8 de julho de 2011

source: For whom is this document intended?
pt_pt: Para quem este documento se dirige?

source: This document presents information about patents and patent liability useful for developers working on community distributions of Free and Open Source Software (FOSS).
pt_pt: Este documento apresenta informações úteis sobre patentes e responsabilidades de patentes para desenvolvedores(as) trabalhando nas distribuições da comunidade de Software Livre e Aberto (FOSS - Free and Open Source Software).

source: By community distributions, we mean collections of free software packages maintained and distributed by organizations composed of volunteers, where neither the organization nor the volunteers seek to make a profit from the activity.
pt_pt: Por distribuições da comunidade queremos dizer as coleções de pacotes mantidos e distribuídos por organizações compostas por voluntários(as), pelas quais organizações e voluntários(as) não buscam lucrar ao exercer essa atividade.
